IDEA Open Model
CrossSectionType Enumeration
Compatible with IDEA StatiCa Beta 20.0
 Type of cross-section
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public enum CrossSectionType
Public Enumeration CrossSectionType
Members
Member name | Value | Description
OneComponentCss | 0 |  Cross-section with one component without shape specification
RolledI | 1 |  Rolled I
RolledAngle | 2 |  Rolled angle
RolledT | 3 |  Rolled T
RolledU | 4 |  Rolled Channel
RolledCHS | 5 |  Rolled circular holow section
RolledRHS | 6 |  Rolled rectangular hollow setion
RolledDoubleUo | 7 |  Composed double U rolled - ][
RolledDoubleUc | 8 |  Composed double U rolled - []
RolledDoubleLt | 10 |  Composed double L rolled - _||_
RolledDoubleLu | 11 |  Pair double L |_ _
RolledTI | 12 |  T profile made from part of I profile
RolledIPar | 13 |  Rolled IPar - Parametrized I section
RolledUPar | 14 |  Rolled UPar - Parametrized Channel section
RolledLPar | 15 |  Rolled LPar - Parametrized Angle section
BoxFl | 16 |  Welded Box - contains two dominante flanges and two webs ----- | | -----
BoxWeb | 17 |  Welded Box - contains two dominante flanges and two webs, bottom flange is inside between webs ------ | | |--
Box2I | 18 |  Box from double I rolled - II
Box2U | 19 |  Box from double 2U
Box2U2PI | 20 |  Box from 2U and 2 Plates
Box2L | 21 |  Box welded from two rolled L-profiles
Box4L | 22 |  Box section welded from 4 L-profiles
Iw | 23 |  Welded I
Iwn | 24 |  Asymmetrical welded I
Tw | 25 |  Welded T
O | 26 |  Circular section
Rect | 27 |  Rectangular
Ign | 28 |  Massive asymetrical I
Igh | 29 |  Massive symetrical I with web root chamfering
Tg | 30 |  Massive T
Lg | 31 |  Massive L
LgMirrored | 32 |  Mirrored Massive L
Ug | 33 |  Massive U
CHSg | 34 |  Massive circular hollow section
Zg | 35 |  Massive Z section
RHSg | 36 |  Massive Rectangular hollow section
Oval | 37 |  Oval shape
General | 38 |  General cross-section
Rolled2I | 39 |  Pair rolled 2I
Trapezoid | 40 |  Trapezoid
Ttfh | 41 |  Massive T with top flange haunch
Twh | 42 |  Massive T with wall haunch
Tgrev | 43 |  Massive T reverse
Ttfhrev | 44 |  Massive T reverse with bottom flange haunch
Twhrev | 45 |  Massive T reverse with wall haunch
Tchamfer1 | 46 |  Massive T chamfer 1
Tchamfer2 | 47 |  Massive T chamfer 2
TT | 48 |  TT section
TT1 | 49 |  TT chamfer section
Sg | 50 |  Massive S section
GeneralSteel | 51 |  General steel cross-section
GeneralConcrete | 52 |  General concrete cross-section
CompositeBeamBox | 53 |  Hollow cross-section with composite slab
CompositeBeamBox1 | 54 |  Hollow cross-section with composite slab
CompositeBeamIgenT | 55 |  I-shaped cross-section with composite slab
CompositeBeamLLeft | 56 |  Composite beam cross-section - L left
CompositeBeamPlate | 57 |  Composite slab
CompositeBeamRResT | 58 |  Composite beam cross-section - R res T
CompositeBeamRResT1 | 59 |  Composite beam cross-section - R res T - 1
CompositeBeamRT | 60 |  Composite beam cross-section - R T
CompositeBeamShapeChamf | 61 |  I-shaped cross-section with composite slab
CompositeBeamShapeChamfAssym | 62 |  Assymetrical I-shaped cross-section with composite slab
CompositeBeamShapeIgen | 63 |  I-shaped cross-section with composite slab
CompositeBeamShapeIT | 64 |  I-shaped cross-section with composite slab
CompositeBeamShapeITAssym | 65 |  Assymetrical I-shaped cross-section with composite slab
CompositeBeamTLeft | 66 |  Composite beam cross-section - T left
CompositeBeamTrapezoid | 67 |  Trapezoidal cross-section with composite slab
CompositeBeamTresT | 68 |  T-shaped cross-section with composite slab
CompositeBeamTrev | 69 |  T-shaped cross-section with composite slab
CompositeBeamTrevResI | 70 |  Composite beam cross-section - T rev res I
CompositeBeamTrevResI1 | 71 |  Composite beam cross-section - T rev res I - 1
CompositeBeamTrevResR | 72 |  Composite beam cross-section - T rev res R
CompositeBeamTrevResR1 | 73 |  Composite beam cross-section - T rev res R - 1
CompositeBeamTrevT | 74 |  Composite beam cross-section - T rev T
CompositeBeamShapeTT | 75 |  Composite beam cross-section - TT
BeamShapeIHaunchChamfer | 76 |  Beam cross-section - I haunch chamfer
BeamShapeIHaunchChamferAssym | 77 |  Beam cross-section - I haunch chamfer assymetric
BeamShapeRevU | 78 |  Beam cross-section - Rev U
BeamShapeBox | 79 |  Beam cross-section - Box
BeamShapeBox1 | 80 |  Beam cross-section - Box - 1
BeamShapeTrevChamferHaunchS | 81 |  Beam cross-section - T rev Chamfer Haunch S
BeamShapeTrevChamferHaunchD | 82 |  Beam cross-section - T rev Chamfer Haunch D
BeamShapeIrevDegen | 83 |  Beam cross-section - I rev Degen
BeamShapeIrevDegenAdd | 84 |  Beam cross-section - I rev Degen Add
BeamShapeTrevDegen | 85 |  Beam cross-section - T rev Degen
BeamShapeTrevDegenAdd | 86 |  Beam cross-section - T rev Degen Add
BeamShapeZDegen | 87 |  Beam cross-section - Z Degen
BeamShapeIZDegen | 88 |  Beam cross-section - IZ Degen
BeamShapeLDegen | 89 |  Beam cross-section - L Degen
CFZ | 90 |  Cold formed thin-wall Z section
CFZed | 91 |  Cold formed thin-wall Z section with lips
CFSigma | 92 |  Cold formed thin-wall sigma section
CFC | 93 |  Cold formed thin-wall C section
CFU | 94 |  Cold formed thin-wall Channel section
CFL | 95 |  Cold formed thin-wall angle section
CFRegPolygon | 96 |  Cold formed thin-wall regular polygon
CFOmega | 97 |  Cold formed thin-wall omega section
BoxDelta | 98 |  Welded box - delta shape
BoxTriangle | 99 |  Welded box - triangular shape
CF2Co | 100 |  Cold formed - Pair 2C - opened (back to back)
CHSPar | 101 |  Parametric circular hollow section
CFLgen | 102 |  Cold formed - general angle section
CFGeneral | 103 |  Cold formed - general shape
CFCp | 104 |  Cold formed thin-wall C+ section
CF2Cpo | 105 |  Cold formed - Pair 2C+ - opened (back to back)
UniqueName | 1001 |  Unique Name
See Also
Reference
IdeaRS.OpenModel.CrossSection Namespace